f4exb/tnc1101/MSP430_USB_API/driverlib/MSP430F5xx_6xx/timer_d.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// timer_d.c - Driver for the timer_d Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup timer_d_api timer_d
//! @{
//
//*****************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_TxD7__
#include "timer_d.h"

#include <assert.h>

#include "tlv.h"
void Timer_D_startCounter(uint16_t baseAddress,
                          uint16_t timerMode)
{
    HWREG16(baseAddress + OFS_TDxCTL0) |= timerMode;
}

void Timer_D_initContinuousMode(uint16_t baseAddress,
                                Timer_D_initContinuousModeParam *param)
{
    HWREG16(baseAddress +
            OFS_TDxCTL0) &= ~(TIMER_D_CLOCKSOURCE_INVERTED_EXTERNAL_TDCLK +
                              TIMER_D_UPDOWN_MODE +
                              TIMER_D_DO_CLEAR +
                              TIMER_D_TDIE_INTERRUPT_ENABLE +
                              ID__8
                              );
    HWREG16(baseAddress + OFS_TDxCTL1) &= ~(TDCLKM0 + TDCLKM1 + TDIDEX_7);

    HWREG16(baseAddress + OFS_TDxCTL0) |= param->clockSource;
    HWREG16(baseAddress + OFS_TDxCTL1) |= (param->clockingMode +
                                           ((param->clockSourceDivider &
                                             0x7) << 8));

    HWREG16(baseAddress + OFS_TDxCTL0) |= (param->timerClear +
                                           param->timerInterruptEnable_TDIE +
                                           ((param->clockSourceDivider >>
                                             3) << 6));
}

void Timer_D_configureContinuousMode(uint16_t baseAddress,
                                     uint16_t clockSource,
                                     uint16_t clockSourceDivider,
                                     uint16_t clockingMode,
                                     uint16_t timerInterruptEnable_TDIE,
                                     uint16_t timerClear)
{
    Timer_D_initContinuousModeParam param = {0};
    param.clockSource = clockSource;
    param.clockSourceDivider = clockSourceDivider;
    param.clockingMode = clockingMode;
    param.timerInterruptEnable_TDIE = timerInterruptEnable_TDIE;
    param.timerClear = timerClear;

    Timer_D_initContinuousMode(baseAddress, &param);
}

void Timer_D_initUpMode(uint16_t baseAddress,
                        Timer_D_initUpModeParam *param)
{
    HWREG16(baseAddress + OFS_TDxCTL0) &=
        ~(TIMER_D_CLOCKSOURCE_INVERTED_EXTERNAL_TDCLK +
          TIMER_D_UPDOWN_MODE +
          TIMER_D_DO_CLEAR +
          TIMER_D_TDIE_INTERRUPT_ENABLE +
          ID__8
          );
    HWREG16(baseAddress + OFS_TDxCTL1) &= ~(TDCLKM0 + TDCLKM1 + TDIDEX_7);

    HWREG16(baseAddress + OFS_TDxCTL0) |= param->clockSource;
    HWREG16(baseAddress + OFS_TDxCTL1) |= (param->clockingMode +
                                           ((param->clockSourceDivider &
                                             0x7) << 8));

    HWREG16(baseAddress + OFS_TDxCTL0) |= (TIMER_D_STOP_MODE +
                                           param->timerClear +
                                           param->timerInterruptEnable_TDIE +
                                           ((param->clockSourceDivider >>
                                             3) << 6));

    if(TIMER_D_CCIE_CCR0_INTERRUPT_ENABLE ==
       param->captureCompareInterruptEnable_CCR0_CCIE)
    {
        HWREG16(baseAddress +
                OFS_TDxCCTL0) |= TIMER_D_CCIE_CCR0_INTERRUPT_ENABLE;
    }
    else
    {
        HWREG16(baseAddress +
                OFS_TDxCCTL0) &= ~TIMER_D_CCIE_CCR0_INTERRUPT_ENABLE;
    }

    HWREG16(baseAddress + OFS_TDxCCR0) = param->timerPeriod;
}

void Timer_D_configureUpMode(uint16_t baseAddress,
                             uint16_t clockSource,
                             uint16_t clockSourceDivider,
                             uint16_t clockingMode,
                             uint16_t timerPeriod,
                             uint16_t timerInterruptEnable_TDIE,
                             uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                             uint16_t timerClear)
{
    Timer_D_initUpModeParam param = {0};
    param.clockSource = clockSource;
    param.clockSourceDivider = clockSourceDivider;
    param.clockingMode = clockingMode;
    param.timerPeriod = timerPeriod;
    param.timerInterruptEnable_TDIE = timerInterruptEnable_TDIE;
    param.captureCompareInterruptEnable_CCR0_CCIE =
        captureCompareInterruptEnable_CCR0_CCIE;
    param.timerClear = timerClear;

