f4exb/tnc1101/MSP430_USB_API/driverlib/MSP430F5xx_6xx/timer_d.c
    Timer_D_initUpMode(baseAddress, &param);
}

void Timer_D_initUpDownMode(uint16_t baseAddress,
                            Timer_D_initUpDownModeParam *param)
{
    HWREG16(baseAddress + OFS_TDxCTL0) &=
        ~(TIMER_D_CLOCKSOURCE_INVERTED_EXTERNAL_TDCLK +
          TIMER_D_UPDOWN_MODE +
          TIMER_D_DO_CLEAR +
          TIMER_D_TDIE_INTERRUPT_ENABLE +
          ID__8
          );
    HWREG16(baseAddress + OFS_TDxCTL1) &= ~(TDCLKM0 + TDCLKM1 + TDIDEX_7);

    HWREG16(baseAddress + OFS_TDxCTL0) |= param->clockSource;
    HWREG16(baseAddress + OFS_TDxCTL1) |= (param->clockingMode +
                                           ((param->clockSourceDivider &
                                             0x7) << 8));

    HWREG16(baseAddress + OFS_TDxCTL0) |= (TIMER_D_STOP_MODE +
                                           param->timerClear +
                                           param->timerInterruptEnable_TDIE +
                                           ((param->clockSourceDivider >>
                                             3) << 6));

    if(TIMER_D_CCIE_CCR0_INTERRUPT_ENABLE ==
       param->captureCompareInterruptEnable_CCR0_CCIE)
    {
        HWREG16(baseAddress +
                OFS_TDxCCTL0) |= TIMER_D_CCIE_CCR0_INTERRUPT_ENABLE;
    }
    else
    {
        HWREG16(baseAddress +
                OFS_TDxCCTL0) &= ~TIMER_D_CCIE_CCR0_INTERRUPT_ENABLE;
    }

    HWREG16(baseAddress + OFS_TDxCCR0) = param->timerPeriod;
}

void Timer_D_configureUpDownMode(uint16_t baseAddress,
                                 uint16_t clockSource,
                                 uint16_t clockSourceDivider,
                                 uint16_t clockingMode,
                                 uint16_t timerPeriod,
                                 uint16_t timerInterruptEnable_TDIE,
                                 uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                 uint16_t timerClear)
{
    Timer_D_initUpDownModeParam param = {0};
    param.clockSource = clockSource;
    param.clockSourceDivider = clockSourceDivider;
    param.clockingMode = clockingMode;
    param.timerPeriod = timerPeriod;
    param.timerInterruptEnable_TDIE = timerInterruptEnable_TDIE;
    param.captureCompareInterruptEnable_CCR0_CCIE =
        captureCompareInterruptEnable_CCR0_CCIE;
    param.timerClear = timerClear;

    Timer_D_initUpDownMode(baseAddress, &param);
}

void Timer_D_initCaptureMode(uint16_t baseAddress,
                             Timer_D_initCaptureModeParam *param)
{
    HWREG16(baseAddress + param->captureRegister) |= CAP;

    HWREG8(baseAddress + OFS_TDxCTL2) |=
        (param->channelCaptureMode <<
        ((param->captureRegister - TIMER_D_CAPTURECOMPARE_REGISTER_0) / 6));

    HWREG16(baseAddress + param->captureRegister) &=
        ~(TIMER_D_CAPTUREMODE_RISING_AND_FALLING_EDGE +
          TIMER_D_CAPTURE_INPUTSELECT_Vcc +
          TIMER_D_CAPTURE_SYNCHRONOUS +
          TIMER_D_DO_CLEAR +
          TIMER_D_TDIE_INTERRUPT_ENABLE +
          CM_3
          );

    HWREG16(baseAddress + param->captureRegister) |= (param->captureMode +
                                                      param->captureInputSelect
                                                      +
                                                      param->
                                                      synchronizeCaptureSource +
                                                      param->
                                                      captureInterruptEnable +
                                                      param->captureOutputMode
                                                      );
}

void Timer_D_initCapture(uint16_t baseAddress,
                         uint16_t captureRegister,
                         uint16_t captureMode,
                         uint16_t captureInputSelect,
                         uint16_t synchronizeCaptureSource,
                         uint16_t captureInterruptEnable,
                         uint16_t captureOutputMode,
                         uint8_t channelCaptureMode)
{
    Timer_D_initCaptureModeParam param = {0};
    param.captureRegister = captureRegister;
    param.captureMode = captureMode;
    param.captureInputSelect = captureInputSelect;
    param.synchronizeCaptureSource = synchronizeCaptureSource;
    param.captureInterruptEnable = captureInterruptEnable;
    param.captureOutputMode = captureOutputMode;
    param.channelCaptureMode = channelCaptureMode;

    Timer_D_initCaptureMode(baseAddress, &param);
}

void Timer_D_initCompareMode(uint16_t baseAddress,
                             Timer_D_initCompareModeParam *param)
{
    HWREG16(baseAddress + param->compareRegister) &= ~CAP;

    HWREG16(baseAddress + param->compareRegister) &=
        ~(TIMER_D_CAPTURECOMPARE_INTERRUPT_ENABLE +
          TIMER_D_OUTPUTMODE_RESET_SET
          );

    HWREG16(baseAddress +
            param->compareRegister) |= (param->compareInterruptEnable +
                                        param->compareOutputMode
                                        );

    HWREG16(baseAddress + param->compareRegister + 2) = param->compareValue;
}

void Timer_D_initCompare(uint16_t baseAddress,
                         uint16_t compareRegister,
                         uint16_t compareInterruptEnable,
                         uint16_t compareOutputMode,
                         uint16_t compareValue)
{
    Timer_D_initCompareModeParam param = {0};
    param.compareRegister = compareRegister;
    param.compareInterruptEnable = compareInterruptEnable;
    param.compareOutputMode = compareOutputMode;
    param.compareValue = compareValue;

    Timer_D_initCompareMode(baseAddress, &param);
}

void Timer_D_enableTimerInterrupt(uint16_t baseAddress)
{
    HWREG8(baseAddress + OFS_TDxCTL0) &= ~TDIFG;
    HWREG8(baseAddress + OFS_TDxCTL0) |= TDIE;
}

void Timer_D_enableHighResInterrupt(uint16_t baseAddress,
                                    uint16_t mask)
{
    HWREG16(baseAddress + OFS_TDxHINT) &= ~(mask >> 8);
    HWREG16(baseAddress + OFS_TDxHINT) |= mask;
}

void Timer_D_disableTimerInterrupt(uint16_t baseAddress)
{
    HWREG8(baseAddress + OFS_TDxCTL0) &= ~TDIE;
}

void Timer_D_disableHighResInterrupt(uint16_t baseAddress,
                                     uint16_t mask)
{
    HWREG16(baseAddress + OFS_TDxHINT) &= ~mask;
}

uint32_t Timer_D_getTimerInterruptStatus(uint16_t baseAddress)
{
    return (HWREG8(baseAddress + OFS_TDxCTL0) & TDIFG);
}

void Timer_D_enableCaptureCompareInterrupt(uint16_t baseAddress,
                                           uint16_t captureCompareRegister)
{
    HWREG8(baseAddress + captureCompareRegister) &= ~CCIFG;
    HWREG16(baseAddress + captureCompareRegister) |= CCIE;
}

void Timer_D_disableCaptureCompareInterrupt(uint16_t baseAddress,
                                            uint16_t captureCompareRegister)
{
    HWREG16(baseAddress + captureCompareRegister) &= ~CCIE;
}

uint32_t Timer_D_getCaptureCompareInterruptStatus(uint16_t baseAddress,
                                                  uint16_t captureCompareRegister,
                                                  uint16_t mask)
{
    return (HWREG16(baseAddress + captureCompareRegister) & mask);
}

uint16_t Timer_D_getHighResInterruptStatus(uint16_t baseAddress,
                                           uint16_t mask)
{
    mask = (mask >> 8);
    return ((HWREG16(baseAddress + OFS_TDxHINT) & mask) << 8);
}

