f4exb/tnc1101/MSP430_USB_API/driverlib/MSP430F5xx_6xx/timer_d.c
void Timer_D_clear(uint16_t baseAddress)
{
    HWREG16(baseAddress + OFS_TDxCTL0) |= TDCLR;
}

void Timer_D_clearHighResInterruptStatus(uint16_t baseAddress,
                                         uint16_t mask)
{
    mask = (mask >> 8);
    HWREG16(baseAddress + OFS_TDxHINT) &= ~mask;
}

uint8_t Timer_D_getSynchronizedCaptureCompareInput(uint16_t baseAddress,
                                                   uint16_t captureCompareRegister,
                                                   uint16_t synchronized)
{
    if(HWREG16(baseAddress + captureCompareRegister) & synchronized)
    {
        return (TIMER_D_CAPTURECOMPARE_INPUT_HIGH);
    }
    else
    {
        return (TIMER_D_CAPTURECOMPARE_INPUT_LOW);
    }
}

uint8_t Timer_D_getOutputForOutputModeOutBitValue(uint16_t baseAddress,
                                                  uint16_t captureCompareRegister)
{
    if(HWREG16(baseAddress + captureCompareRegister) & OUT)
    {
        return (TIMER_D_OUTPUTMODE_OUTBITVALUE_HIGH);
    }
    else
    {
        return (TIMER_D_OUTPUTMODE_OUTBITVALUE_LOW);
    }
}

uint16_t Timer_D_getCaptureCompareCount(uint16_t baseAddress,
                                        uint16_t captureCompareRegister)
{
    return  (HWREG16(baseAddress + captureCompareRegister + 2));
}

uint16_t Timer_D_getCaptureCompareLatchCount(uint16_t baseAddress,
                                             uint16_t captureCompareRegister)
{
    return  (HWREG16(baseAddress + captureCompareRegister + 4));
}

uint8_t Timer_D_getCaptureCompareInputSignal(uint16_t baseAddress,
                                             uint16_t captureCompareRegister)
{
    return  ((HWREG8(baseAddress + captureCompareRegister) & CCI));
}

void Timer_D_setOutputForOutputModeOutBitValue(uint16_t baseAddress,
                                               uint16_t captureCompareRegister,
                                               uint8_t outputModeOutBitValue)
{
    HWREG16(baseAddress + captureCompareRegister) &= ~OUT;
    HWREG16(baseAddress + captureCompareRegister) |= outputModeOutBitValue;
}

void Timer_D_outputPWM(uint16_t baseAddress,
                       Timer_D_outputPWMParam *param)
{
    HWREG16(baseAddress + OFS_TDxCTL1) &= ~(TDCLKM0 + TDCLKM1 + TDIDEX_7);

    HWREG16(baseAddress + OFS_TDxCTL0) &=
        ~(TIMER_D_CLOCKSOURCE_INVERTED_EXTERNAL_TDCLK +
          TIMER_D_UPDOWN_MODE + TIMER_D_DO_CLEAR +
          TIMER_D_TDIE_INTERRUPT_ENABLE +
          ID__8
          );

    HWREG16(baseAddress + OFS_TDxCTL0) |= param->clockSource;
    HWREG16(baseAddress + OFS_TDxCTL1) |= (param->clockingMode +
                                           ((param->clockSourceDivider &
                                             0x7) << 8));

    HWREG16(baseAddress + OFS_TDxCTL0) |= (TIMER_D_UP_MODE +
                                           TIMER_D_DO_CLEAR +
                                           ((param->clockSourceDivider >>
                                             3) << 6));

    HWREG16(baseAddress + OFS_TDxCCR0) = param->timerPeriod;

    HWREG16(baseAddress + OFS_TDxCCTL0) &=
        ~(TIMER_D_CAPTURECOMPARE_INTERRUPT_ENABLE +
          TIMER_D_OUTPUTMODE_RESET_SET
          );
    HWREG16(baseAddress + param->compareRegister) |= param->compareOutputMode;

    HWREG16(baseAddress + param->compareRegister + 2) = param->dutyCycle;
}

void Timer_D_generatePWM(uint16_t baseAddress,
                         uint16_t clockSource,
                         uint16_t clockSourceDivider,
                         uint16_t clockingMode,
                         uint16_t timerPeriod,
                         uint16_t compareRegister,
                         uint16_t compareOutputMode,
                         uint16_t dutyCycle)
{
    Timer_D_outputPWMParam param = {0};
    param.clockSource = clockSource;
    param.clockSourceDivider = clockSourceDivider;
    param.clockingMode = clockingMode;
    param.timerPeriod = timerPeriod;
    param.compareRegister = compareRegister;
    param.compareOutputMode = compareOutputMode;
    param.dutyCycle = dutyCycle;

    Timer_D_outputPWM(baseAddress, &param);
}

void Timer_D_stop(uint16_t baseAddress)
{
    HWREG16(baseAddress + OFS_TDxCTL0) &= ~MC_3;
    HWREG16(baseAddress + OFS_TDxCTL0) |= MC_0;
}

void Timer_D_setCompareValue(uint16_t baseAddress,
                             uint16_t compareRegister,
                             uint16_t compareValue)
{
    HWREG16(baseAddress + compareRegister + 0x02) = compareValue;
}

void Timer_D_clearTimerInterruptFlag(uint16_t baseAddress)
{
    HWREG16(baseAddress + OFS_TDxCTL0) &= ~TDIFG;
}

void Timer_D_clearCaptureCompareInterruptFlag(uint16_t baseAddress,
                                              uint16_t captureCompareRegister)
{
    HWREG16(baseAddress + captureCompareRegister) &= ~CCIFG;
}

uint8_t Timer_D_initHighResGeneratorInFreeRunningMode(uint16_t baseAddress,
                                                      uint8_t desiredHighResFrequency)
{
    struct s_TLV_Timer_D_Cal_Data * pTD0CAL;
    uint8_t TD0CAL_bytes;

    // Read the TimerD TLV Data
    TLV_getInfo(TLV_TAG_TIMER_D_CAL,
                0,
                &TD0CAL_bytes,
                (uint16_t **)&pTD0CAL
                );

    if(0x00 == TD0CAL_bytes)
    {
        // No TimerD free running cal data found
        return(STATUS_FAIL);
    }

    HWREG16(baseAddress + OFS_TDxHCTL1) = TDHCLKTRIM6;
    HWREG16(baseAddress + OFS_TDxCTL1) = 0x00;
    HWREG16(baseAddress + OFS_TDxHCTL0) = 0x00;

    switch(desiredHighResFrequency)
    {
    case TIMER_D_HIGHRES_64MHZ:
        HWREG16(baseAddress + OFS_TDxHCTL1) = pTD0CAL->TDH0CTL1_64;
        break;

    case TIMER_D_HIGHRES_128MHZ:
        HWREG16(baseAddress + OFS_TDxHCTL1) = pTD0CAL->TDH0CTL1_128;
        break;

    case TIMER_D_HIGHRES_200MHZ:
        HWREG16(baseAddress + OFS_TDxHCTL1) = pTD0CAL->TDH0CTL1_200;
        break;

    case TIMER_D_HIGHRES_256MHZ:
        HWREG16(baseAddress + OFS_TDxHCTL1) = pTD0CAL->TDH0CTL1_256;
        break;
    }

    // Select Hi-res local clock
    HWREG16(baseAddress + OFS_TDxCTL1) |= TDCLKM_1;

    // CALEN=0 => free running mode; enable Hi-res mode
    if(TIMER_D_HIGHRES_256MHZ == desiredHighResFrequency)
    {
        HWREG16(baseAddress + OFS_TDxHCTL0) |= TDHM_1;
    }

    HWREG16(baseAddress + OFS_TDxHCTL0) |= TDHEN;

    return(STATUS_SUCCESS);
}

void Timer_D_initHighResGeneratorInRegulatedMode(uint16_t baseAddress,
                                                 Timer_D_initHighResGeneratorInRegulatedModeParam *param)
{
    HWREG16(baseAddress + OFS_TDxCTL0) &= ~(TDSSEL_3 + TDHD_3 + TDCLR + ID__8);
    HWREG16(baseAddress + OFS_TDxCTL1) &= ~(TDCLKM0 + TDCLKM1 + TDIDEX_7);

    HWREG16(baseAddress + OFS_TDxCTL0) |= (param->clockSource +
                                           ((param->clockSourceDivider >>
                                             3) << 6));
    HWREG16(baseAddress + OFS_TDxCTL1) |= (param->clockingMode +
                                           ((param->clockSourceDivider &
                                             0x7) << 8));

    // Select Hi-res local clock
    // Calibration and Hi-res mode enable
    HWREG16(baseAddress + OFS_TDxCTL1) |= TDCLKM_1;
    // Select Hi-res local clock
    HWREG16(baseAddress + OFS_TDxHCTL0) = TDHREGEN + TDHEN;
    HWREG16(baseAddress + OFS_TDxHCTL0) |= param->highResClockMultiplyFactor +
                                           param->highResClockDivider;
}

void Timer_D_configureHighResGeneratorInRegulatedMode(uint16_t baseAddress,
                                                      uint16_t clockSource,
                                                      uint16_t clockSourceDivider,
                                                      uint16_t clockingMode,
                                                      uint8_t highResClockMultiplyFactor,
                                                      uint8_t highResClockDivider)
{
    Timer_D_initHighResGeneratorInRegulatedModeParam param = {0};
    param.clockSource = clockSource;
    param.clockSourceDivider = clockSourceDivider;
    param.clockingMode = clockingMode;
    param.highResClockMultiplyFactor = highResClockMultiplyFactor;
    param.highResClockDivider = highResClockDivider;

