f4exb/tnc1101/MSP430_USB_API/driverlib/MSP430F5xx_6xx/timer_d.c
    Timer_D_initHighResGeneratorInRegulatedMode(baseAddress, &param);
}

void Timer_D_combineTDCCRToOutputPWM(uint16_t baseAddress,
                                     Timer_D_combineTDCCRToOutputPWMParam *param)
{
    HWREG16(baseAddress + OFS_TDxCCTL2) &= ~OUTMOD_7;
    HWREG16(baseAddress + OFS_TDxCCTL2) |= param->compareOutputMode;

    HWREG16(baseAddress + OFS_TDxCCR0) = param->timerPeriod;

    HWREG16(baseAddress + OFS_TDxCCR1 + (0x05 *
                                         (param->combineCCRRegistersCombination
                                          - TIMER_D_COMBINE_CCR1_CCR2))) =
        param->dutyCycle1;
    HWREG16(baseAddress + OFS_TDxCCR2 + (0x05 *
                                         (param->combineCCRRegistersCombination
                                          - TIMER_D_COMBINE_CCR1_CCR2))) =
        param->dutyCycle2;

    HWREG16(baseAddress + OFS_TDxCTL0) &= ~ID__8;
    HWREG16(baseAddress + OFS_TDxCTL1) &= ~(TDCLKM0 + TDCLKM1 + TDIDEX_7);

    HWREG16(baseAddress + OFS_TDxCTL0) |= (param->clockSource +
                                           ((param->clockSourceDivider >>
                                             3) << 6));
    HWREG16(baseAddress + OFS_TDxCTL1) |= (param->clockingMode +
                                           ((param->clockSourceDivider &
                                             0x7) << 8));
    HWREG16(baseAddress + OFS_TDxCTL1) |=
        (TD2CMB <<
        (param->combineCCRRegistersCombination - TIMER_D_COMBINE_CCR1_CCR2));
}

void Timer_D_combineTDCCRToGeneratePWM(uint16_t baseAddress,
                                       uint16_t clockSource,
                                       uint16_t clockSourceDivider,
                                       uint16_t clockingMode,
                                       uint16_t timerPeriod,
                                       uint16_t combineCCRRegistersCombination,
                                       uint16_t compareOutputMode,
                                       uint16_t dutyCycle1,
                                       uint16_t dutyCycle2)
{
    Timer_D_combineTDCCRToOutputPWMParam param = {0};
    param.clockSource = clockSource;
    param.clockSourceDivider = clockSourceDivider;
    param.clockingMode = clockingMode;
    param.timerPeriod = timerPeriod;
    param.combineCCRRegistersCombination = combineCCRRegistersCombination;
    param.compareOutputMode = compareOutputMode;
    param.dutyCycle1 = dutyCycle1;
    param.dutyCycle2 = dutyCycle2;

    Timer_D_combineTDCCRToOutputPWM(baseAddress, &param);
}

void Timer_D_selectLatchingGroup(uint16_t baseAddress,
                                 uint16_t groupLatch)
{
    HWREG16(baseAddress + OFS_TDxCTL0) &= ~TDCLGRP_3;
    HWREG16(baseAddress + OFS_TDxCTL0) |= groupLatch;
}

void Timer_D_selectCounterLength(uint16_t baseAddress,
                                 uint16_t counterLength)
{
    HWREG16(baseAddress + OFS_TDxCTL0) &= ~CNTL_3;
    HWREG16(baseAddress + OFS_TDxCTL0) |= counterLength;
}

void Timer_D_initCompareLatchLoadEvent(uint16_t baseAddress,
                                       uint16_t compareRegister,
                                       uint16_t compareLatchLoadEvent)
{
    HWREG16(baseAddress + compareRegister) &= ~CLLD_3;
    HWREG16(baseAddress + compareRegister) |= compareLatchLoadEvent;
}

void Timer_D_disableHighResFastWakeup(uint16_t baseAddress)
{
    HWREG16(baseAddress + OFS_TDxHCTL0) &= ~TDHFW;
}

void Timer_D_enableHighResFastWakeup(uint16_t baseAddress)
{
    HWREG16(baseAddress + OFS_TDxHCTL0) |= TDHFW;
}

void Timer_D_disableHighResClockEnhancedAccuracy(uint16_t baseAddress)
{
    HWREG16(baseAddress + OFS_TDxHCTL0) &= ~TDHEAEN;
}

void Timer_D_enableHighResClockEnhancedAccuracy(uint16_t baseAddress)
{
    HWREG16(baseAddress + OFS_TDxHCTL0) |= TDHEAEN;
}

void Timer_D_disableHighResGeneratorForceON(uint16_t baseAddress)
{
    HWREG16(baseAddress + OFS_TDxHCTL0) &= ~TDHRON;
}

void Timer_D_enableHighResGeneratorForceON(uint16_t baseAddress)
{
    HWREG16(baseAddress + OFS_TDxHCTL0) |= TDHRON;
}

void Timer_D_selectHighResCoarseClockRange(uint16_t baseAddress,
                                           uint16_t highResCoarseClockRange)
{
    HWREG16(baseAddress + OFS_TDxHCTL1) &= ~TDHCLKCR;
    HWREG16(baseAddress + OFS_TDxHCTL1) |= highResCoarseClockRange;
}

void Timer_D_selectHighResClockRange(uint16_t baseAddress,
                                     uint16_t highResClockRange)
{
    HWREG16(baseAddress + OFS_TDxHCTL1) &= ~TDHCLKCR;
    HWREG16(baseAddress + OFS_TDxHCTL1) |= highResClockRange;
}

uint16_t Timer_D_getCounterValue(uint16_t baseAddress)
{
    uint16_t voteOne, voteTwo, res;

    voteTwo = HWREG16(baseAddress + OFS_TDxR);

    do
    {
        voteOne = voteTwo;
        voteTwo = HWREG16(baseAddress + OFS_TDxR);

        if(voteTwo > voteOne)
        {
            res = voteTwo - voteOne;
        }
        else if(voteOne > voteTwo)
        {
            res = voteOne - voteTwo;
        }
        else
        {
            res = 0;
        }
    }
    while(res > TIMER_D_THRESHOLD);

    return(voteTwo);
}

#endif
//*****************************************************************************
//
//! Close the doxygen group for timer_d_api
//! @}
//
//*****************************************************************************
//Released_Version_4_20_00
